Revit 2027 API
AnalysisResultSchema.IsEqual Method
 Determines if the input object is equivalent to this AnalysisResultSchema.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	AnalysisResultSchema other
)
Public Function IsEqual (
	other As AnalysisResultSchema
) As Boolean
public:
bool IsEqual(
	AnalysisResultSchema^ other
)
member IsEqual :
        other : AnalysisResultSchema -> bool
Parameters
other AnalysisResultSchema
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace